{"class_name": "Model", "config": {"name": "vae_mlp", "layers": [{"name": "input_563", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13881], "dtype": "float32", "sparse": false, "name": "input_563"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "input_563", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13881], "dtype": "float32", "sparse": false, "name": "input_563"}, "inbound_nodes": []}, {"name": "dense_2811", "class_name": "Dense", "config": {"name": "dense_2811", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_563", 0, 0, {}]]]}, {"name": "dense_2812", "class_name": "Dense", "config": {"name": "dense_2812", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2811", 0, 0, {}]]]}, {"name": "dense_2813", "class_name": "Dense", "config": {"name": "dense_2813", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2811", 0, 0, {}]]]}, {"name": "lambda_563", "class_name": "Lambda", "config": {"name": "lambda_563", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczwAAABkAX0BfABcAn0CfQN0AGoBdACgAnwCoQFkAhkAfAFm\nAmQDZARkBY0DfQR8AnQAoAN8A6EBfAQUABcAUwApBk7pHgAAAOkAAAAA5wAAAAAAAAAA55qZmZmZ\nmbk/KQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpBNoBS9oNcmFuZG9tX25vcm1hbHIFAAAA2gNleHAp\nBdoEYXJnc9oKbGF0ZW50X2RpbdoGel9tZWFu2gt6X2xvZ19zaWdtYdoHZXBzaWxvbqkAchAAAAD6\nHjxpcHl0aG9uLWlucHV0LTItZTYxNWMxYzE0MzQ2PtoIc2FtcGxpbmc/AAAAcwoAAAAAAQQBCAEU\nAQoB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_2812", 0, 0, {}], ["dense_2813", 0, 0, {}]]]}], "input_layers": [["input_563", 0, 0]], "output_layers": [["dense_2812", 0, 0], ["dense_2813", 0, 0], ["lambda_563", 0, 0]]}, "inbound_nodes": [[["input_563", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_2814", "class_name": "Dense", "config": {"name": "dense_2814", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"name": "dense_2815", "class_name": "Dense", "config": {"name": "dense_2815", "trainable": true, "dtype": "float32", "units": 13881, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2814", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["dense_2815", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["input_563", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}