{"class_name": "Model", "config": {"name": "vae_mlp", "layers": [{"name": "input_370", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8736], "dtype": "float32", "sparse": false, "name": "input_370"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "input_370", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8736], "dtype": "float32", "sparse": false, "name": "input_370"}, "inbound_nodes": []}, {"name": "dense_1846", "class_name": "Dense", "config": {"name": "dense_1846", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_370", 0, 0, {}]]]}, {"name": "dense_1847", "class_name": "Dense", "config": {"name": "dense_1847", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1846", 0, 0, {}]]]}, {"name": "dense_1848", "class_name": "Dense", "config": {"name": "dense_1848", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1846", 0, 0, {}]]]}, {"name": "lambda_370", "class_name": "Lambda", "config": {"name": "lambda_370", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczwAAABkAX0BfABcAn0CfQN0AGoBdACgAnwCoQFkAhkAfAFm\nAmQDZARkBY0DfQR8AnQAoAN8A6EBfAQUABcAUwApBk7pHgAAAOkAAAAA5wAAAAAAAAAA55qZmZmZ\nmbk/KQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpBNoBS9oNcmFuZG9tX25vcm1hbHIFAAAA2gNleHAp\nBdoEYXJnc9oKbGF0ZW50X2RpbdoGel9tZWFu2gt6X2xvZ19zaWdtYdoHZXBzaWxvbqkAchAAAAD6\nHzxpcHl0aG9uLWlucHV0LTE3LWI5NDQ0MDhlNjdkMz7aCHNhbXBsaW5nPwAAAHMKAAAAAAEEAQgB\nFAEKAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_1847", 0, 0, {}], ["dense_1848", 0, 0, {}]]]}], "input_layers": [["input_370", 0, 0]], "output_layers": [["dense_1847", 0, 0], ["dense_1848", 0, 0], ["lambda_370", 0, 0]]}, "inbound_nodes": [[["input_370", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_1849", "class_name": "Dense", "config": {"name": "dense_1849", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"name": "dense_1850", "class_name": "Dense", "config": {"name": "dense_1850", "trainable": true, "dtype": "float32", "units": 8736, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1849", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["dense_1850", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["input_370", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}