{"class_name": "Model", "config": {"name": "vae_mlp", "layers": [{"name": "input_472", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16443], "dtype": "float32", "sparse": false, "name": "input_472"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "input_472", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16443], "dtype": "float32", "sparse": false, "name": "input_472"}, "inbound_nodes": []}, {"name": "dense_2356", "class_name": "Dense", "config": {"name": "dense_2356", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_472", 0, 0, {}]]]}, {"name": "dense_2357", "class_name": "Dense", "config": {"name": "dense_2357", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2356", 0, 0, {}]]]}, {"name": "dense_2358", "class_name": "Dense", "config": {"name": "dense_2358", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2356", 0, 0, {}]]]}, {"name": "lambda_472", "class_name": "Lambda", "config": {"name": "lambda_472", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczwAAABkAX0BfABcAn0CfQN0AGoBdACgAnwCoQFkAhkAfAFm\nAmQDZARkBY0DfQR8AnQAoAN8A6EBfAQUABcAUwApBk7pHgAAAOkAAAAA5wAAAAAAAAAA55qZmZmZ\nmbk/KQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpBNoBS9oNcmFuZG9tX25vcm1hbHIFAAAA2gNleHAp\nBdoEYXJnc9oKbGF0ZW50X2RpbdoGel9tZWFu2gt6X2xvZ19zaWdtYdoHZXBzaWxvbqkAchAAAAD6\nHjxpcHl0aG9uLWlucHV0LTItZTYxNWMxYzE0MzQ2PtoIc2FtcGxpbmc/AAAAcwoAAAAAAQQBCAEU\nAQoB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_2357", 0, 0, {}], ["dense_2358", 0, 0, {}]]]}], "input_layers": [["input_472", 0, 0]], "output_layers": [["dense_2357", 0, 0], ["dense_2358", 0, 0], ["lambda_472", 0, 0]]}, "inbound_nodes": [[["input_472", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_2359", "class_name": "Dense", "config": {"name": "dense_2359", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"name": "dense_2360", "class_name": "Dense", "config": {"name": "dense_2360", "trainable": true, "dtype": "float32", "units": 16443, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2359", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["dense_2360", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["input_472", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}