{"class_name": "Model", "config": {"name": "vae_mlp", "layers": [{"name": "input_213", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14805], "dtype": "float32", "sparse": false, "name": "input_213"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "input_213", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14805], "dtype": "float32", "sparse": false, "name": "input_213"}, "inbound_nodes": []}, {"name": "dense_1061", "class_name": "Dense", "config": {"name": "dense_1061", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_213", 0, 0, {}]]]}, {"name": "dense_1062", "class_name": "Dense", "config": {"name": "dense_1062", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1061", 0, 0, {}]]]}, {"name": "dense_1063", "class_name": "Dense", "config": {"name": "dense_1063", "trainable": true, "dtype": "float32", "units": 30, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1061", 0, 0, {}]]]}, {"name": "lambda_213", "class_name": "Lambda", "config": {"name": "lambda_213", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABQAAAAUAAABDAAAAczwAAABkAX0BfABcAn0CfQN0AGoBdACgAnwCoQFkAhkAfAFm\nAmQDZARkBY0DfQR8AnQAoAN8A6EBfAQUABcAUwApBk7pHgAAAOkAAAAA5wAAAAAAAAAA55qZmZmZ\nmbk/KQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpBNoBS9oNcmFuZG9tX25vcm1hbHIFAAAA2gNleHAp\nBdoEYXJnc9oKbGF0ZW50X2RpbdoGel9tZWFu2gt6X2xvZ19zaWdtYdoHZXBzaWxvbqkAchAAAAD6\nHzxpcHl0aG9uLWlucHV0LTE3LWI5NDQ0MDhlNjdkMz7aCHNhbXBsaW5nPwAAAHMKAAAAAAEEAQgB\nFAEKAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_1062", 0, 0, {}], ["dense_1063", 0, 0, {}]]]}], "input_layers": [["input_213", 0, 0]], "output_layers": [["dense_1062", 0, 0], ["dense_1063", 0, 0], ["lambda_213", 0, 0]]}, "inbound_nodes": [[["input_213", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "dense_1064", "class_name": "Dense", "config": {"name": "dense_1064", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"name": "dense_1065", "class_name": "Dense", "config": {"name": "dense_1065", "trainable": true, "dtype": "float32", "units": 14805, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1064", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["dense_1065", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["input_213", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}